IZ7BOJ/ESP32_LoRa_APRS_SARIMESH/src/ezTime_loc.cpp
// ezTime_loc.cpp
#include "ezTime_loc.h"

#ifdef EZTIME_GPS_RTC

#ifdef EZTIME_NETWORK_ENABLE
  #ifdef EZTIME_CACHE_NVS
    #include <Preferences.h>    // For timezone lookup cache
  #endif
  #ifdef EZTIME_CACHE_EEPROM
    #include <EEPROM.h>
  #endif  
  #if defined(ESP8266)
    #include <ESP8266WiFi.h>
    #include <WiFiUdp.h>
  #elif defined(ARDUINO_SAMD_MKR1000)
    #include <SPI.h>
    #include <WiFi101.h>
    #include <WiFiUdp.h>
  #elif defined(EZTIME_ETHERNET)
    #include <SPI.h>
    #include <Ethernet.h>
    #include <EthernetUdp.h>
  #else
    #include <WiFi.h>
    #include <WiFiUdp.h>
  #endif

#endif // 123

#if defined(EZTIME_MAX_DEBUGLEVEL_NONE)
  #define err(args...)    ""
  #define errln(args...)    ""
  #define info(args...)     ""
  #define infoln(args...)   ""
  #define debug(args...)    ""
  #define debugln(args...)  ""
#elif defined(EZTIME_MAX_DEBUGLEVEL_ERROR)
  #define err(args...)    if (_debug_level >= ERROR) _debug_device->print(args)
  #define errln(args...)    if (_debug_level >= ERROR) _debug_device->println(args)
  #define info(args...)     ""
  #define infoln(args...)   ""
  #define debug(args...)    ""
  #define debugln(args...)  ""
#elif defined(EZTIME_MAX_DEBUGLEVEL_INFO)
  #define err(args...)    if (_debug_level >= ERROR) _debug_device->print(args)
  #define errln(args...)    if (_debug_level >= ERROR) _debug_device->println(args)
  #define info(args...)     if (_debug_level >= INFO) _debug_device->print(args)
  #define infoln(args...)   if (_debug_level >= INFO) _debug_device->println(args)
  #define debug(args...)    ""
  #define debugln(args...)  ""
#else   // nothing specified compiles everything in.
  #define err(args...)    if (_debug_level >= ERROR) _debug_device->print(args)
  #define errln(args...)    if (_debug_level >= ERROR) _debug_device->println(args)
  #define info(args...)     if (_debug_level >= INFO) _debug_device->print(args)
  #define infoln(args...)   if (_debug_level >= INFO) _debug_device->println(args)
  #define debug(args...)    if (_debug_level >= DEBUG) _debug_device->print(args)
  #define debugln(args...)  if (_debug_level >= DEBUG) _debug_device->println(args)
#endif // 456


 const uint8_t monthDays[]={31,28,31,30,31,30,31,31,30,31,30,31}; // API starts months from 1, this array starts from 0

// The private things go in an anonymous namespace
namespace {

  ezError_t _last_error = NO_ERROR;
  String _server_error = "";
  ezDebugLevel_t _debug_level = NONE;
  Print *_debug_device = (Print *)&Serial;
  ezEvent_t _events[MAX_EVENTS];
  time_t _last_sync_time = 0;
  time_t _last_read_t = 0;
  uint32_t _last_sync_millis = 0;
  uint16_t _last_read_ms;
  timeStatus_t _time_status;
  bool _initialised = false;
  #ifdef EZTIME_NETWORK_ENABLE
    uint16_t _ntp_interval = NTP_INTERVAL;
    String _ntp_server = NTP_SERVER;
  #endif

  void triggerError(const ezError_t err) {
    _last_error = err;
    if (_last_error) {
      err("triggerError: ERROR -> ");
      errln(ezt::errorString(err));
    }
  }

  String debugLevelString(const ezDebugLevel_t level) {
    switch (level) {
      case NONE: return   F("NONE");
      case ERROR: return  F("debugLevelString: ERROR");
      case INFO: return   F("INFO");
      default: return   F("DEBUG");
    }
  }

  time_t nowUTC(const bool update_last_read = true) {
    time_t t;
    uint32_t m = millis();
    t = _last_sync_time + ((m - _last_sync_millis) / 1000);
    if (update_last_read) {
      _last_read_t = t;
      _last_read_ms = (m - _last_sync_millis) % 1000;
    }
    return t;
  }

}

// The mail ezTime namespace
namespace ezt {

  ////////// Error handing

  String errorString(const ezError_t err /* = LAST_ERROR */) {
    switch (err) {
      case NO_ERROR: return       F("OK");
      case LAST_ERROR: return       errorString(_last_error);
      case NO_NETWORK: return       F("No network");
      case TIMEOUT: return        F("Timeout");
      case CONNECT_FAILED: return     F("Connect Failed");
      case DATA_NOT_FOUND: return     F("Data not found");
      case LOCKED_TO_UTC: return      F("Locked to UTC");
      case NO_CACHE_SET: return     F("No cache set");
      case CACHE_TOO_SMALL: return    F("Cache too small");
      case TOO_MANY_EVENTS: return    F("Too many events");
      case INVALID_DATA: return     F("Invalid data received from NTP server");
      case SERVER_ERROR: return     _server_error; 
      default: return           F("Unkown error");
    }
  }

  ezError_t error(const bool reset /* = false */) {
    ezError_t tmp = _last_error;
    if (reset) _last_error = NO_ERROR;
    return tmp;
  }

  void setDebug(const ezDebugLevel_t level) {
    setDebug(level, *_debug_device);
  }

  void setDebug(const ezDebugLevel_t level, Print &device) { 
    _debug_level = level;
    _debug_device = &device;
    info("ezTime debug level set to ");
    infoln(debugLevelString(level));
  }


  // The include below includes the dayStr, dayShortStr, monthStr and monthShortStr from the appropriate language file
  // in the /src/lang subdirectory.



    #include "lang/EN.h"


  //

  timeStatus_t timeStatus() { return _time_status; }

  void events() {
    if (!_initialised) {  // only executed on init
      for (uint8_t n = 0; n < MAX_EVENTS; n++) _events[n] = { 0, NULL };
      #ifdef EZTIME_NETWORK_ENABLE
        if (_ntp_interval) update_NTP_GPS(); // Start the cycle of update_NTP_GPS running and then setting an event for its next run
      #endif
      _initialised = true;
      };
    // See if any events are due
    for (uint8_t n = 0; n < MAX_EVENTS; n++) {
      if (_events[n].function && ( nowUTC(false) >= _events[n].time)) {
        debug("Running event (#"); debug(n + 1); debug(") set for "); debugln(UTC.dateTime(_events[n].time));
        void (*tmp)() = _events[n].function;
        if(ezTime_debug) {debugA("\nezTime_events: Running event (#"); debugA(") set for "); debugA("%s",UTC.dateTime(_events[n].time));};
        _events[n].time = 0 ; // Delete any events pointing here, in case called manually
        _events[n] = { 0, NULL };   // reset the event
//        Serial.println(" ==================>  before func ");
        (tmp)();            // execute the function
//        Serial.println(" ==================>  after func ");
//removed        if (_ntp_interval) _events[n].time = nowUTC(false) + _ntp_interval ;
      }
    }
    yield();
  }

  void deleteEvent(const uint8_t event_handle) { 
    if (event_handle && event_handle <= MAX_EVENTS) {
      debug(F("Deleted event (#")); debug(event_handle); debug(F("), set for ")); debugln(UTC.dateTime(_events[event_handle - 1].time));  
      _events[event_handle - 1] = { 0, NULL };
    }
  }

  void deleteEvent(void (*function)()) { 
    for (uint8_t n = 0; n< MAX_EVENTS; n++) {
      if (_events[n].function == function) {
        debug(F("Deleted event (#")); debug(n + 1); debug(F("), set for ")); debugln(UTC.dateTime(_events[n].time));
        _events[n] = { 0, NULL };
      }
    }
  }

  void breakTime(const time_t timeInput, tmElements_t &tm){
    // break the given time_t into time components
    // this is a more compact version of the C library localtime function
    // note that year is offset from 1970 !!!

    uint8_t year;
    uint8_t month, monthLength;
    uint32_t time;
    unsigned long days;

    time = (uint32_t)timeInput;
    tm.Second = time % 60;
    time /= 60; // now it is minutes
    tm.Minute = time % 60;
    time /= 60; // now it is hours
    tm.Hour = time % 24;
    time /= 24; // now it is days
    tm.Wday = ((time + 4) % 7) + 1;  // Sunday is day 1 

    year = 0;  
    days = 0;
    while((unsigned)(days += (LEAP_YEAR(year) ? 366 : 365)) <= time) {
      year++;
    }
    tm.Year = year; // year is offset from 1970 

    days -= LEAP_YEAR(year) ? 366 : 365;
    time  -= days; // now it is days in this year, starting at 0

    days=0;
    month=0;
    monthLength=0;
    for (month=0; month<12; month++) {
      if (month==1) { // february
        if (LEAP_YEAR(year)) {
          monthLength=29;
        } else {
          monthLength=28;
        }
      } else {
        monthLength = monthDays[month];
      }

      if (time >= monthLength) {
        time -= monthLength;
      } else {
        break;
      }
    }
    tm.Month = month + 1;  // jan is month 1  
    tm.Day = time + 1;     // day of month
  }

  time_t makeTime(const uint8_t hour, const uint8_t minute, const uint8_t second, const uint8_t day, const uint8_t month, const uint16_t year) {
    tmElements_t tm;
    tm.Hour = hour;
    tm.Minute = minute;
    tm.Second = second;
    tm.Day = day;
    tm.Month = month;
    if (year > 68) {      // time_t cannot reach beyond 68 + 1970 anyway, so if bigger user means actual years
      tm.Year = year - 1970;
    } else {
      tm.Year = year;
    }
    return makeTime(tm);
  }

  time_t makeTime(tmElements_t &tm){
  // assemble time elements into time_t 
  // note year argument is offset from 1970 (see macros in time.h to convert to other formats)
  // previous version used full four digit year (or digits since 2000),i.e. 2009 was 2009 or 9
  
