IZ7BOJ/ESP32_LoRa_APRS_SARIMESH/src/ezTime_loc.cpp
    int i;
    uint32_t seconds;

    // seconds from 1970 till 1 jan 00:00:00 of the given year
    seconds= tm.Year * SECS_PER_DAY * 365UL;

    for (i = 0; i < tm.Year; i++) {
      if (LEAP_YEAR(i)) {
        seconds +=  SECS_PER_DAY;   // add extra days for leap years
      }
    }

    // add days for this year, months start from 1
    for (i = 1; i < tm.Month; i++) {
      if ( (i == 2) && LEAP_YEAR(tm.Year)) { 
        seconds += SECS_PER_DAY * 29UL;
      } else {
        seconds += SECS_PER_DAY * (uint32_t)monthDays[i-1];  //monthDay array starts from 0
      }
    }
  
    seconds+= (tm.Day-1) * SECS_PER_DAY;
    seconds+= tm.Hour * 3600UL;
    seconds+= tm.Minute * 60UL;
    seconds+= tm.Second;
    
    return (time_t)seconds; 
  }

  // makeOrdinalTime allows you to resolve "second thursday in September in 2018" into a number of seconds since 1970
  // (Very useful for the timezone calculations that ezTime does internally) 
  // If ordinal is 0 or 5 it is taken to mean "the last $wday in $month"
  time_t makeOrdinalTime(const uint8_t hour, const uint8_t minute, uint8_t const second, uint8_t ordinal, const uint8_t wday, const uint8_t month, uint16_t year) {
    if (year <= 68 ) year = 1970 + year;    // fix user intent
    uint8_t m = month;   
    uint8_t w = ordinal;
    if (w == 5) { 
      ordinal = 0;
      w = 0;
    }
    if (w == 0) {     // is this a "Last week" rule?
      if (++m > 12) {   // yes, for "Last", go to the next month
        m = 1;
        ++year;
      }
      w = 1;               // and treat as first week of next month, subtract 7 days later
    }
    time_t t = makeTime(hour, minute, second, 1, m, year);
    // add offset from the first of the month to weekday, and offset for the given week
    t += ( (wday - UTC.weekday(t) + 7) % 7 + (w - 1) * 7 ) * SECS_PER_DAY;
    // back up a week if this is a "Last" rule
    if (ordinal == 0) t -= 7 * SECS_PER_DAY;
    return t;
  }

  String zeropad(const uint32_t number, const uint8_t length) {
    String out;
    out.reserve(length);
    out = String(number);
    while (out.length() < length) out = "0" + out;
    return out;
  }

  time_t compileTime(const String compile_date /* = __DATE__ */, const String compile_time /* = __TIME__ */) {
  
    uint8_t hrs = compile_time.substring(0,2).toInt();
    uint8_t min = compile_time.substring(3,5).toInt();
    uint8_t sec = compile_time.substring(6).toInt();
    uint8_t day = compile_date.substring(4,6).toInt();
    int16_t year = compile_date.substring(7).toInt();
    String iterate_month;
    for (uint8_t month = 1; month < 13; month++) {
      iterate_month = monthStr(month);
      if ( iterate_month.substring(0,3) == compile_date.substring(0,3) ) {
        return makeTime(hrs, min, sec, day, month, year);
      }
    }
    return 0;
  }

  bool secondChanged() {
    time_t t = nowUTC(false);
    if (_last_read_t != t) return true;
    return false;
  }

  bool minuteChanged() {
    time_t t = nowUTC(false);
    if (_last_read_t / 60 != t / 60) return true;
    return false;
  }

//********************************************************************
bool queryGPS(time_t &GPS_t,  unsigned long  &GPS_measured_at ){  // return last GPS_PPS rising edge time and millis ; if GPS is not valid return false, either true
  vTaskDelay(pdMS_TO_TICKS(500));  // wait 0,5 sec to be safe 
  bool boolCheck = true; 
  int sats=gps.satellites.value();  
  struct tm mytm;
  // GPS_sync_time is taken from ISR and is reported as now() at Interrupt service routine execution time
  if((gps_debug)||(ezTime_debug)) debugA("GPS_sync_time from ISR = %ld - GPS_rising_pps_millis = %d \r",GPS_sync_time, GPS_rising_pps_millis);
  char date_string[100];   // calculate the virtual time of the seconds boundary based non time strings coming from GPS
  if((gps_debug)||(ezTime_debug)) debugA( "GPS position fix found: date = %d/%d/%d %d:%d:%d\r" ,gps.date.day(),gps.date.month(),gps.date.year(), gps.time.hour(),gps.time.minute(),gps.time.second());
  sprintf(date_string, "%d/%d/%d %d:%d:%d" ,gps.date.day(),gps.date.month(),gps.date.year(), gps.time.hour(),gps.time.minute(),gps.time.second());
  strptime(date_string ,"%d/%m/%Y %H:%M:%S",&mytm);
  GPS_sync_time = mktime(&mytm) + 7200 + 1;   // this is the virtual time with 1 sec granulariry

  if(gps.satellites.value() > 3 ){
     if((gps_debug)||(ezTime_debug)) debugA("GPS_sync_time = %d - GPS_rising_pps_millis = %d - gps.satellites.value = %d \r",  GPS_sync_time, GPS_rising_pps_millis, gps.satellites.value());  // time & millis of last GPS_PPS rising edge
     GPS_t =  GPS_sync_time;  
     GPS_measured_at = GPS_rising_pps_millis;
     return boolCheck ;
     }
  else{
     if((gps_debug)||(ezTime_debug)) debugA("GPS position fix is still invalid\r");
     if((gps_debug)||(ezTime_debug)) debugA("GPS_sync_time = %d - GPS_rising_pps_millis = %d - gps.satellites.value = %d \r",  GPS_sync_time, GPS_rising_pps_millis, gps.satellites.value());  // time & millis of last GPS_PPS rising edge
     bool boolCheck = false; 
     GPS_t =  GPS_sync_time;  
     GPS_measured_at = GPS_rising_pps_millis;
     return boolCheck;
     };
}


//********************************************************************


  #ifdef EZTIME_NETWORK_ENABLE

//==========================================================

void update_NTP_GPS() {   // updates NTP_time_status and GPS_time_status
    deleteEvent(update_NTP_GPS); // Delete any events pointing here, in case called manually
    time_t t=0; time_t t_NTP; time_t t_GPS;
    unsigned long measured_at; unsigned long measured_at_NTP; unsigned long measured_at_GPS;
    bool ezTime_debug_old = ezTime_debug;  // ezTime_debug=1 ;
    if(ezTime_debug) debugA("update_NTP_GPS......\r");
    bool query_ret ; bool query_ret_NTP ; bool query_ret_GPS ;
    if(ezTime_debug) debugA("NTPServer_eztime = %s  ntpServer = %s   LocalTimeNow before update = %d/%d %s",_ntp_server.c_str(), ntpServer.c_str() , now(),millis(), ( UTC.dateTime(now(), "d-M-y H:i:s.v T\n")).c_str()  ); 
    query_ret_NTP = queryNTP(_ntp_server, t_NTP, measured_at_NTP);    
    query_ret_GPS = queryGPS(t_GPS, measured_at_GPS );
                
    if((op_status == 3)&& query_ret_GPS ) {
        t=t_GPS ; 
        measured_at = measured_at_GPS ;
       }
    else if((op_status < 3)&& query_ret_NTP ) {
        t=t_NTP ;
        measured_at = measured_at_NTP ;
       };

    if(query_ret_GPS ) GPS_last_sync_time = t_GPS ;
    if(query_ret_NTP ) NTP_last_sync_time = t_NTP ;

    if ((query_ret_NTP || query_ret_GPS ) && t) {
       // at least one of the time sync sources is available     
       if(ezTime_debug) debugA("query_ret_NTP = %d -  query_ret_GPS = %d - time/measured_at=%d/%d\r",query_ret_NTP, query_ret_GPS , t, measured_at);
       int32_t correction = ( (t - _last_sync_time) * 1000 ) - ( measured_at - _last_sync_millis );
       if (abs(correction) < 900 ) time_jitter = (time_jitter + abs(correction))/ 2 ; 
//     if (abs(correction) < 900 ) { time_jitter = (time_jitter + abs(correction))/ 2 ; } else {time_jitter= -1 ; } ;
       if(ezTime_debug) debugA("===> correction=%ld - time_jitter=%ld\r", correction, time_jitter);
       if((_last_sync_time )&& (op_status == 3)){   // GPS time fix must be 1sec jump tolerant...
          if(ezTime_debug) debugA("before NTP_GPS time fixing: time/correction = %d/%d\r", t, correction);
          if (correction > 900) {
             t = t -1 ;
             correction = ( (t - _last_sync_time) * 1000 ) - ( measured_at - _last_sync_millis );
             if(ezTime_debug) debugA("after NTP_GPS time fixing: time/correction = %d/%d\r", t, correction);
             }
          else if (correction < -900) {
             t = t + 1 ;
             correction = ( (t - _last_sync_time) * 1000 ) - ( measured_at - _last_sync_millis );
             if(ezTime_debug) debugA("after NTP_GPS time fixing: time/correction = %d/%d\r", t, correction);
            };
            
