IZ7BOJ/ESP32_LoRa_APRS_SARIMESH/src/ezTime_loc.cpp
         };

        _last_sync_time = t;
        _last_sync_millis = measured_at;
        _last_read_ms = ( millis() - measured_at) % 1000;
        _time_status = timeSet;   
       if(query_ret_GPS) { GPS_time_status = timeSet;} else {GPS_time_status = timeNotSet;};
       if(query_ret_NTP) { NTP_time_status = timeSet;} else {NTP_time_status = timeNotSet;};
       
       if(ezTime_debug) debugA("Received time: %s\r",(UTC.dateTime(t, "d-M-y H:i:s.v T")).c_str());
       if (_time_status != timeNotSet) {
         String res;

          if (!correction) {
             res= String("spot on\r");
             } 
          else {
            res=String(abs(correction));
            if (correction > 0) {
               res = res  + String(" ms fast");
               } 
            else {
               res = res  + String(" ms slow");
               };  // end of correction >0 
            };   //  end of correction 
        if(ezTime_debug) debugA("====> internal clock was %s \r", res.c_str());
            
          } 
       else {
          if(ezTime_debug)  debugA("\r");
          };  // end of != timeNotSet
                 
       if(ezTime_debug)debugA("(NTP_GPS_OK) LocalTimeNow after update = %d/%d - GPS_time_status = %d - NTP_time_status = %d at %s",now(),millis(), GPS_time_status, NTP_time_status, (UTC.dateTime(t, "d-M-y H:i:s.v T")).c_str()); 
       } // query ret with _time_status = timeSet
  else {  // both the time sync sources are not available... try to see if it will be recovered in a short time...
          // declare timeNotSet due to failed sync source
          _time_status = timeNotSet;
          if(query_ret_GPS) { GPS_time_status = timeSet;} else {GPS_time_status = timeNotSet;};
          if(query_ret_NTP) { NTP_time_status = timeSet;} else {NTP_time_status = timeNotSet;};
                 
          if(ezTime_debug){ 
             debugA("(NTP_GPS_FAILED) LocalTimeNow after update = %d/%d - GPS_time_status = %d - NTP_time_status = %d at ",now(),millis(), GPS_time_status, NTP_time_status); 
             debugA("%s",UTC.dateTime(now(), "d-M-y H:i:s.v T\r"));
             };             

       }; // query ret false
       ezTime_debug = ezTime_debug_old ;
}


//==========================================================


    // This is a nice self-contained NTP routine if you need one: feel free to use it.
    // It gives you the seconds since 1970 (unix epoch) and the millis() on your system when 
    // that happened (by deducting fractional seconds and estimated network latency).


bool queryNTP(const String server, time_t &t, unsigned long &measured_at) {
      if(ezTime_debug) debugA("quering server = %s\r", server.c_str()); 

      #ifndef EZTIME_ETHERNET
      if(! standalone){
        if (WiFi.status() != WL_CONNECTED) { 
          triggerError(NO_NETWORK); 
          if(ezTime_debug) debugA("NO_NETWORK\r\n"); 
          return false; 
          }
        };  
        WiFiUDP udp;
      #endif

      if( standalone ) return false;  // if neither wifi nor ethernet is available just fail..

  
      // Send NTP packet
      byte buffer[NTP_PACKET_SIZE];
      memset(buffer, 0, NTP_PACKET_SIZE);
      buffer[0] = 0b11100011;   // LI, Version, Mode
      buffer[1] = 0;        // Stratum, or type of clock
      buffer[2] = 9;        // Polling Interval (9 = 2^9 secs = ~9 mins, close to our 10 min default)
      buffer[3] = 0xEC;     // Peer Clock Precision
                    // 8 bytes of zero for Root Delay & Root Dispersion
      buffer[12]  = 'X';      // "kiss code", see RFC5905
      buffer[13]  = 'E';      // (codes starting with 'X' are not interpreted)
      buffer[14]  = 'Z';
      buffer[15]  = 'T';  
  
      udp.flush();
      udp.begin(NTP_LOCAL_PORT);
      unsigned long started = millis();
      udp.beginPacket(server.c_str(), 123); //NTP requests are to port 123
      udp.write(buffer, NTP_PACKET_SIZE);
      udp.endPacket();

      // Wait for packet or return false with timed out
      while (!udp.parsePacket()) {
     //   debugA("parsePacket = %d %s", NTP_TIMEOUT, (UTC.dateTime(t, "d-M-y H:i:s.v T")).c_str());
        delay (1);
        // vTaskDelay(pdMS_TO_TICKS(20));
        if (millis() - started > NTP_TIMEOUT) {
          udp.stop(); 
          triggerError(TIMEOUT); 
          if(ezTime_debug) debugA("query TIMEOUT...\r"); 
          return false;
        }
      }
      udp.read(buffer, NTP_PACKET_SIZE);
      udp.stop();                         // On AVR there's only very limited sockets, we want to free them when done.
      //print out received packet for debug
      int i;
      debug(F("Received data:"));
      for (i = 0; i < NTP_PACKET_SIZE; i++) {
        if ((i % 4) == 0) {
          debugln();
          debug(String(i) + ": ");
        }
        debug(buffer[i], HEX);
        debug(F(", "));
      }
      debugln();

      //prepare timestamps
      uint32_t highWord, lowWord; 
      highWord = ( buffer[16] << 8 | buffer[17] ) & 0x0000FFFF;
      lowWord = ( buffer[18] << 8 | buffer[19] ) & 0x0000FFFF;
      uint32_t reftsSec = highWord << 16 | lowWord;       // reference timestamp seconds

      highWord = ( buffer[32] << 8 | buffer[33] ) & 0x0000FFFF;
      lowWord = ( buffer[34] << 8 | buffer[35] ) & 0x0000FFFF;
      uint32_t rcvtsSec = highWord << 16 | lowWord;       // receive timestamp seconds

      highWord = ( buffer[40] << 8 | buffer[41] ) & 0x0000FFFF;
      lowWord = ( buffer[42] << 8 | buffer[43] ) & 0x0000FFFF;
      uint32_t secsSince1900 = highWord << 16 | lowWord;      // transmit timestamp seconds

      highWord = ( buffer[44] << 8 | buffer[45] ) & 0x0000FFFF;
      lowWord = ( buffer[46] << 8 | buffer[47] ) & 0x0000FFFF;
      uint32_t fraction = highWord << 16 | lowWord;       // transmit timestamp fractions 

      //check if received data makes sense
      //buffer[1] = stratum - should be 1..15 for valid reply
      //also checking that all timestamps are non-zero and receive timestamp seconds are <= transmit timestamp seconds
      if ((buffer[1] < 1) or (buffer[1] > 15) or (reftsSec == 0) or (rcvtsSec == 0) or (rcvtsSec > secsSince1900)) {
        // we got invalid packet
        triggerError(INVALID_DATA); 
        if(ezTime_debug) debugA("received INVALID_DATA\r"); 
        return false;
      }

      // Set the t and measured_at variables that were passed by reference
      uint32_t done = millis();
      if(ezTime_debug) debugA("queryNTP: success (round trip %ld ms)\r", done - started); 
      t = secsSince1900 - 2208988800UL;         // Subtract 70 years to get seconds since 1970
      uint16_t ms = fraction / 4294967UL;         // Turn 32 bit fraction into ms by dividing by 2^32 / 1000 
      measured_at = done - ((done - started) / 2) - ms; // Assume symmetric network latency and return when we think the whole second was.
//    if(ezTime_debug) debugA("query RETURN_TRUE\r");         
      return true;
    }

