IZ7BOJ/ESP32_LoRa_APRS_SARIMESH/src/ezTime_loc.cpp
    void setInterval(const uint16_t seconds /* = 0 */) { 
      deleteEvent(update_NTP_GPS);
      _ntp_interval = seconds;
      if (seconds) UTC.setEvent(update_NTP_GPS, nowUTC(false) + _ntp_interval);
    }

    void setServer(const String ntp_server /* = NTP_SERVER */) { _ntp_server = ntp_server; ntpServer = ntp_server.c_str(); }

    bool waitForSync(const uint16_t timeout /* = 0 */) {

      unsigned long start = millis();
    
      #if !defined(EZTIME_ETHERNET)
      if(! standalone){  
        if (WiFi.status() != WL_CONNECTED) {
          if(ezTime_debug) info(F("Waiting for WiFi ... "));
          while (WiFi.status() != WL_CONNECTED) {
            if ( timeout && (millis() - start) / 1000 > timeout ) { triggerError(TIMEOUT); return false;};
            events();
            vTaskDelay(pdMS_TO_TICKS(25));
          }
          if(ezTime_debug) infoln(F("connected"));
        }
      };  
      #endif

      if (_time_status != timeSet) {
        if(ezTime_debug)  infoln(F("Waiting for time sync"));
        while (_time_status != timeSet) {
          if ( timeout && (millis() - start) / 1000 > timeout ) { triggerError(TIMEOUT); return false;};
          vTaskDelay(pdMS_TO_TICKS(250));
          events();
        }
        if(ezTime_debug)  infoln(F("Time is in sync"));
      }
      return true;
    }
    
    time_t lastNtpUpdateTime() { return _last_sync_time; }
  
  #endif // EZTIME_NETWORK_ENABLE

}

//
// Timezone class
//

Timezone::Timezone(const bool locked_to_UTC /* = false */) {
  _locked_to_UTC = locked_to_UTC;
  _posix = "UTC";
  #ifdef EZTIME_NETWORK_ENABLE
    #ifdef EZTIME_CACHE_EEPROM
      _cache_month = 0;
      _eeprom_address = -1;
    #endif
    #ifdef EZTIME_CACHE_NVS
      _cache_month = 0;
      _nvs_name = "";
      _nvs_key = "";
    #endif
    _olson = "";
  #endif
}

bool Timezone::setPosix(const String posix) {
  if (_locked_to_UTC) { triggerError(LOCKED_TO_UTC); return false; }
  _posix = posix;
  #ifdef EZTIME_NETWORK_ENABLE
    _olson = "";
  #endif
  return true;
}

time_t Timezone::now() { return tzTime(); }

time_t Timezone::tzTime(time_t t /* = TIME_NOW */, ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  if (_locked_to_UTC) return nowUTC();  // just saving some time and memory
  String tzname;
  bool is_dst;
  int16_t offset;
  return tzTime(t, local_or_utc, tzname, is_dst, offset);
}

time_t Timezone::tzTime(time_t t, ezLocalOrUTC_t local_or_utc, String &tzname, bool &is_dst, int16_t &offset) {

  if (t == TIME_NOW) {
    t = nowUTC(); 
    local_or_utc = UTC_TIME;
  } else if (t == LAST_READ) {
    t = _last_read_t;
    local_or_utc = UTC_TIME;
  }
  
  int8_t offset_hr = 0;
  uint8_t offset_min = 0;
  int8_t dst_shift_hr = 1;
  uint8_t dst_shift_min = 0;
  
  uint8_t start_month = 0, start_week = 0, start_dow = 0, start_time_hr = 2, start_time_min = 0;
  uint8_t end_month = 0, end_week = 0, end_dow = 0, end_time_hr = 2, end_time_min = 0;
  
  enum posix_state_e {STD_NAME, OFFSET_HR, OFFSET_MIN, DST_NAME, DST_SHIFT_HR, DST_SHIFT_MIN, START_MONTH, START_WEEK, START_DOW, START_TIME_HR, START_TIME_MIN, END_MONTH, END_WEEK, END_DOW, END_TIME_HR, END_TIME_MIN};
  posix_state_e state = STD_NAME; 

  bool ignore_nums = false;
  char c = 1; // Dummy value to get while(newchar) started
  uint8_t strpos = 0;
  uint8_t stdname_end = _posix.length() - 1;
  uint8_t dstname_begin = _posix.length();
  uint8_t dstname_end = _posix.length();

  while (strpos < _posix.length()) {
    c = (char)_posix[strpos];

    // Do not replace the code below with switch statement: evaluation of state that 
    // changes while this runs. (Only works because this state can only go forward.)

    if (c && state == STD_NAME) {
      if (c == '<') ignore_nums = true;
      if (c == '>') ignore_nums = false;
      if (!ignore_nums && (isDigit(c) || c == '-'  || c == '+')) {
        state = OFFSET_HR;
        stdname_end = strpos - 1;
      }
    }
    if (c && state == OFFSET_HR) {
      if (c == '+') {
        // Ignore the plus
      } else if (c == ':') {
        state = OFFSET_MIN;
        c = 0;
      } else if (c != '-' && !isDigit(c)) {
        state = DST_NAME;
        dstname_begin = strpos;
      } else {
        if (!offset_hr) offset_hr = atoi(_posix.c_str() + strpos);
      }
    }     
    if (c && state == OFFSET_MIN) {
      if (!isDigit(c)) {
        state = DST_NAME;
        ignore_nums = false;
      } else {
        if (!offset_min) offset_min = atoi(_posix.c_str() + strpos);
      }
    }       
    if (c && state == DST_NAME) {
      if (c == '<') ignore_nums = true;
      if (c == '>') ignore_nums = false;
      if (c == ',') {
        state = START_MONTH;
        c = 0;
        dstname_end = strpos - 1;
      } else if (!ignore_nums && (c == '-' || isDigit(c))) {
        state = DST_SHIFT_HR;
        dstname_end = strpos - 1;
      }
    }   
    if (c && state == DST_SHIFT_HR) {
      if (c == ':') {
        state = DST_SHIFT_MIN;
        c = 0;
      } else if (c == ',') {
        state = START_MONTH;
        c = 0;
      } else if (dst_shift_hr == 1) dst_shift_hr = atoi(_posix.c_str() + strpos);
    }     
    if (c && state == DST_SHIFT_MIN) {
      if (c == ',') {
        state = START_MONTH;
        c = 0;
      } else if (!dst_shift_min) dst_shift_min = atoi(_posix.c_str() + strpos);
    }     
    if (c && state == START_MONTH) {
      if (c == '.') {
        state = START_WEEK;
        c = 0;
      } else if (c != 'M' && !start_month) start_month = atoi(_posix.c_str() + strpos); 
    }     
    if (c && state == START_WEEK) {
      if (c == '.') {
        state = START_DOW;
        c = 0;
      } else start_week = c - '0';
    }   
    if (c && state == START_DOW) {
      if (c == '/') {
        state = START_TIME_HR;
        c = 0;
      } else if (c == ',') {
        state = END_MONTH;
        c = 0;
      } else start_dow = c - '0';       
    }
    if (c && state == START_TIME_HR) {
      if (c == ':') {
        state = START_TIME_MIN;
        c = 0;
      } else if (c == ',') {
        state = END_MONTH;
        c = 0;
      } else if (start_time_hr == 2) start_time_hr = atoi(_posix.c_str() + strpos);
    }   
    if (c && state == START_TIME_MIN) {
      if (c == ',') {
        state = END_MONTH;
        c = 0;
      } else if (!start_time_min) start_time_min = atoi(_posix.c_str() + strpos);
    }   
    if (c && state == END_MONTH) {
      if (c == '.') {
        state = END_WEEK;
        c = 0;
      } else if (c != 'M') if (!end_month) end_month = atoi(_posix.c_str() + strpos);
    }     
    if (c && state == END_WEEK) {
      if (c == '.') {
        state = END_DOW;
        c = 0;
      } else end_week = c - '0';
    }   
    if (c && state == END_DOW) {
      if (c == '/') {
        state = END_TIME_HR;
        c = 0;      
      } else end_dow = c - '0';
    }
    if (c && state == END_TIME_HR) {
      if (c == ':') {
        state = END_TIME_MIN;
        c = 0;
      }  else if (end_time_hr == 2) end_time_hr = atoi(_posix.c_str() + strpos);
    }   
    if (c && state == END_TIME_MIN) {
      if (!end_time_min) end_time_min = atoi(_posix.c_str() + strpos);
    }
    strpos++;
  } 
  
