IZ7BOJ/ESP32_LoRa_APRS_SARIMESH/src/ezTime_loc.cpp
  int16_t std_offset = (offset_hr < 0) ? offset_hr * 60 - offset_min : offset_hr * 60 + offset_min;
  
  tzname = _posix.substring(0, stdname_end + 1);  // Overwritten with dstname later if needed
  if (!start_month) {
    if (tzname == "UTC" && std_offset) tzname = "???";
    is_dst = false;
    offset = std_offset;
  } else {
    int16_t dst_offset = std_offset - dst_shift_hr * 60 - dst_shift_min;
    // to find the year
    tmElements_t tm;
    ezt::breakTime(t, tm);  
    
    // in local time
    time_t dst_start = ezt::makeOrdinalTime(start_time_hr, start_time_min, 0, start_week, start_dow + 1, start_month, tm.Year + 1970);
    time_t dst_end = ezt::makeOrdinalTime(end_time_hr, end_time_min, 0, end_week, end_dow + 1, end_month, tm.Year + 1970);
    
    if (local_or_utc == UTC_TIME) {
      dst_start += std_offset * 60LL;
      dst_end += dst_offset * 60LL;
    }
    
    if (dst_end > dst_start) {
      is_dst = (t >= dst_start && t < dst_end);   // northern hemisphere
    } else {
      is_dst = !(t >= dst_end && t < dst_start);    // southern hemisphere
    }

    if (is_dst) {
      offset = dst_offset;
      tzname = _posix.substring(dstname_begin, dstname_end + 1);
    } else {
      offset = std_offset;
    }
  }

  if (local_or_utc == LOCAL_TIME) {
    return t + offset * 60LL;
  } else {
    return t - offset * 60LL;
  }
}

String Timezone::getPosix() { return _posix; }

#ifdef EZTIME_NETWORK_ENABLE

  bool Timezone::setLocation(const String location /* = "GeoIP" */) {
  
    if(ezTime_debug)  info(F("Timezone lookup for: "));
    if(ezTime_debug)  info(location);
    if(ezTime_debug)  info(F(" ... "));
    if (_locked_to_UTC) { triggerError(LOCKED_TO_UTC); return false; }
    
    #ifndef EZTIME_ETHERNET
    if(! standalone){
      if (WiFi.status() != WL_CONNECTED) {
        triggerError(NO_NETWORK); 
        return false; 
        };
      } 
      else {
        return false; 
      };  
      WiFiUDP udp;
    #else
      EthernetUDP udp;
    #endif
    
    udp.flush();
    udp.begin(TIMEZONED_LOCAL_PORT);
    unsigned long started = millis();
    udp.beginPacket(TIMEZONED_REMOTE_HOST, TIMEZONED_REMOTE_PORT);
    udp.write((const uint8_t*)location.c_str(), location.length());
    udp.endPacket();
    
    // Wait for packet or return false with timed out
    while (!udp.parsePacket()) {
      delay (1);
      if (millis() - started > TIMEZONED_TIMEOUT) {
        udp.stop(); 
        triggerError(TIMEOUT);
        return false;
      }
    }
    // Stick result in String recv 
    String recv;
    recv.reserve(60);
    while (udp.available()) recv += (char)udp.read();
    udp.stop();
    if(ezTime_debug)  info(F("(round-trip "));
    if(ezTime_debug) info(millis() - started);
    if(ezTime_debug) info(F(" ms)  "));
    if (recv.substring(0,6) == "ERROR ") {
      _server_error = recv.substring(6);
      error (SERVER_ERROR);
      return false;
    }
    if (recv.substring(0,3) == "OK ") {
      _olson = recv.substring(3, recv.indexOf(" ", 4));
      _posix = recv.substring(recv.indexOf(" ", 4) + 1);
      if(ezTime_debug) infoln(F("success."));
      if(ezTime_debug) info(F("  Olson: ")); infoln(_olson);
      if(ezTime_debug) info(F("  Posix: ")); infoln(_posix);
      #if defined(EZTIME_CACHE_EEPROM) || defined(EZTIME_CACHE_NVS)
        String tzinfo = _olson + " " + _posix;
        writeCache(tzinfo);   // caution, byref to save memory, tzinfo mangled afterwards
      #endif
      return true;
    }
    error (DATA_NOT_FOUND);
    return false;
  }
  
  
  String Timezone::getOlson() {
    return _olson;
  }

  String Timezone::getOlsen() {
    return _olson;
  } 


  #if defined(EZTIME_CACHE_EEPROM) || defined(EZTIME_CACHE_NVS)
  
    #if defined(ESP32) || defined(ESP8266)
      #define eepromBegin() EEPROM.begin(4096)
      #define eepromEnd()   EEPROM.end()
      #define eepromLength()  (4096)
    #else
      #define eepromBegin() ""
      #define eepromEnd()   ""
      #define eepromLength()  EEPROM.length()
    #endif
    
    #ifdef EZTIME_CACHE_EEPROM
      bool Timezone::setCache(const int16_t address) {
        eepromBegin();
        if (address + EEPROM_CACHE_LEN > eepromLength()) { triggerError(CACHE_TOO_SMALL); return false; }
        _eeprom_address = address;
        eepromEnd();
        return setCache();
      }
    #endif
  
    #ifdef EZTIME_CACHE_NVS
      bool Timezone::setCache(const String name, const String key) {
        _nvs_name = name;
        _nvs_key = key;
        return setCache();
      }
    #endif

    bool Timezone::setCache() {
      String olson, posix;
      uint8_t months_since_jan_2018;
      if (readCache(olson, posix, months_since_jan_2018)) {
        setPosix(posix);
        _olson = olson;
        _cache_month = months_since_jan_2018;
        if ( (year() - 2018) * 12 + month(LAST_READ) - months_since_jan_2018 > MAX_CACHE_AGE_MONTHS) {
          infoln(F("Cache stale, getting fresh"));
          setLocation(olson);
        }
        return true;
      }
      return false;
    }
    
    void Timezone::clearCache(const bool delete_section /* = false */) {
    
      #ifdef EZTIME_CACHE_EEPROM
        eepromBegin();
        if (_eeprom_address < 0) { triggerError(NO_CACHE_SET); return; }
        for (int16_t n = _eeprom_address; n < _eeprom_address + EEPROM_CACHE_LEN; n++) EEPROM.write(n, 0);
        eepromEnd();
      #endif

      #ifdef EZTIME_CACHE_NVS
        if (_nvs_name == "" || _nvs_key == "") { triggerError(NO_CACHE_SET); return; }
        Preferences prefs;
        prefs.begin(_nvs_name.c_str(), false);
        if (delete_section) {
          prefs.clear();
        } else {
          prefs.remove(_nvs_key.c_str());
        }
        prefs.end();
      #endif
    }

    bool Timezone::writeCache(String &str) {
      uint8_t months_since_jan_2018 = 0;
      if (year() >= 2018) months_since_jan_2018 = (year(LAST_READ) - 2018) * 12 + month(LAST_READ) - 1;

