IZ7BOJ/ESP32_LoRa_APRS_SARIMESH/src/ezTime_loc.cpp
      #ifdef EZTIME_CACHE_EEPROM
        if (_eeprom_address < 0) return false;

        if(ezTime_debug) info(F("Caching timezone data  "));
        if (str.length() > MAX_CACHE_PAYLOAD) { triggerError(CACHE_TOO_SMALL); return false; }
        
        uint16_t last_byte = _eeprom_address + EEPROM_CACHE_LEN - 1;  
        uint16_t addr = _eeprom_address;
        
        eepromBegin();
        
        // First byte is cache age, in months since 2018
        EEPROM.write(addr++, months_since_jan_2018);
        
        // Second byte is length of payload
        EEPROM.write(addr++, str.length());
        
        // Followed by payload, compressed. Every 4 bytes to three by encoding only 6 bits, ASCII all-caps
        str.toUpperCase();
        uint8_t store = 0;
        for (uint8_t n = 0; n < str.length(); n++) {
          unsigned char c = str.charAt(n) - 32;
          if ( c > 63) c = 0;
          switch (n % 4) {
            case 0:
              store = c << 2;         //all of 1st
              break;
            case 1:
              store |= c >> 4;        //high two of 2nd
              EEPROM.write(addr++, store);   
              store = c << 4;         //low four of 2nd
              break;
            case 2:
              store |= c >> 2;        //high four of 3rd
              EEPROM.write(addr++, store);
              store = c << 6;         //low two of third
              break;
            case 3:
              store |= c;           //all of 4th
              EEPROM.write(addr++, store);
              store = 0;
          }
        }
        if (store) EEPROM.write(addr++, store);
        
        // Fill rest of cache (except last byte) with zeroes
        for (; addr < last_byte; addr++) EEPROM.write(addr, 0);

        // Add all bytes in cache % 256 and add 42, that is the checksum written to last byte.
        // The 42 is because then checksum of all zeroes then isn't zero.
        uint8_t checksum = 0;
        for (uint16_t n = _eeprom_address; n < last_byte; n++) checksum += EEPROM.read(n);
        checksum += 42;
        EEPROM.write(last_byte, checksum);
        eepromEnd();
        infoln();
        return true;
      #endif
      
      #ifdef EZTIME_CACHE_NVS
        if (_nvs_name == "" || _nvs_key == "") return false;
        if(ezTime_debug) infoln(F("Caching timezone data"));
        Preferences prefs;
        prefs.begin(_nvs_name.c_str(), false);
        String tmp = String(months_since_jan_2018) + " " + str;
        prefs.putString(_nvs_key.c_str(), tmp);
        prefs.end();
        return true;
      #endif
    }
  

    bool Timezone::readCache(String &olson, String &posix, uint8_t &months_since_jan_2018) {

      #ifdef EZTIME_CACHE_EEPROM
        if (_eeprom_address < 0) { triggerError(NO_CACHE_SET); return false; }
        eepromBegin();
        uint16_t last_byte = _eeprom_address + EEPROM_CACHE_LEN - 1;      
        
        for (uint16_t n = _eeprom_address; n <= last_byte; n++) {
          debug(n);
          debug(F(" "));
          debugln(EEPROM.read(n), HEX);
        }
        
        // return false if checksum incorrect
        uint8_t checksum = 0;
        for (uint16_t n = _eeprom_address; n < last_byte; n++) checksum += EEPROM.read(n);
        checksum += 42;       
        if (checksum != EEPROM.read(last_byte)) { eepromEnd(); return false; }
        debugln(F("Checksum OK"));
        
        // Return false if length impossible
        uint8_t len = EEPROM.read(_eeprom_address + 1);
        debug("Length: "); debugln(len);
        if (len > MAX_CACHE_PAYLOAD) { eepromEnd(); return false; }
        
        // OK, we're gonna decompress
        olson.reserve(len + 3);   // Everything goes in olson first. Decompression might overshoot 3 
        months_since_jan_2018 = EEPROM.read(_eeprom_address);
        
        for (uint8_t n = 0; n < EEPROM_CACHE_LEN - 3; n++) {
          uint16_t addr = n + _eeprom_address + 2;
          uint8_t c = EEPROM.read(addr);
          uint8_t p = EEPROM.read(addr - 1);  // previous byte
          switch (n % 3) {
            case 0:
              olson += (char)( ((c & 0b11111100) >> 2) + 32 );
              break;
            case 1:
              olson += (char)( ((p & 0b00000011) << 4) + ((c & 0b11110000) >> 4) + 32 );
              break;
            case 2:
              olson += (char)( ((p & 0b00001111) << 2) + ((c & 0b11000000) >> 6) + 32 );
              olson += (char)( (c & 0b00111111) + 32 );
          }
          if (olson.length() >= len) break;
        }
        
        uint8_t first_space = olson.indexOf(' ');
        posix = olson.substring(first_space + 1, len);
        olson = olson.substring(0, first_space);
        
        // Restore case of olson (best effort)
        String olson_lowercase = olson;
        olson_lowercase.toLowerCase();
        for (uint8_t n = 1; n < olson.length(); n++) {
          unsigned char p = olson.charAt(n - 1);  // previous character
          if (p != '_' && p != '/' && p != '-') {
            olson.setCharAt(n, olson_lowercase[n]);
          }
        }
        if(ezTime_debug)  info(F("Cache read. Olson: ")); info(olson); info (F("  Posix: ")); infoln(posix);
        eepromEnd();
        return true;
      #endif            
      
      #ifdef EZTIME_CACHE_NVS
        if (_nvs_name == "" || _nvs_key == "") { triggerError(NO_CACHE_SET); return false; }
        
        Preferences prefs;
        prefs.begin(_nvs_name.c_str(), true);
        String read_string = prefs.getString(_nvs_key.c_str());
        read_string.trim();
        prefs.end();
        if (read_string == "") return false;
        
        uint8_t first_space = read_string.indexOf(' ');
        uint8_t second_space = read_string.indexOf(' ', first_space + 1);
        if (first_space && second_space) {
          months_since_jan_2018 = read_string.toInt();
          posix = read_string.substring(second_space + 1);
          olson = read_string.substring(first_space + 1, second_space);
          info(F("Cache read. Olson: ")); info(olson); info (F("  Posix: ")); infoln(posix);
          return true;
        }
        return false;
      #endif
    }
    
  #endif  // defined(EZTIME_CACHE_EEPROM) || defined(EZTIME_CACHE_NVS)


