IZ7BOJ/ESP32_LoRa_APRS_SARIMESH/src/ezTime_loc.cpp
#endif // EZTIME_NETWORK_ENABLE


void Timezone::setDefault() {
  defaultTZ = this;
  debug(F("Default timezone set to ")); debug(_olson); debug(F("  "));debugln(_posix);
}

bool Timezone::isDST(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  String tzname;
  bool is_dst;
  int16_t offset;
  t = tzTime(t, local_or_utc, tzname, is_dst, offset);
  return is_dst;
}

String Timezone::getTimezoneName(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  String tzname;
  bool is_dst;
  int16_t offset;
  t = tzTime(t, local_or_utc, tzname, is_dst, offset);
  return tzname;
}

int16_t Timezone::getOffset(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  String tzname;
  bool is_dst;
  int16_t offset;
  t = tzTime(t, local_or_utc, tzname, is_dst, offset);
  return offset;
}

uint8_t Timezone::setEvent(void (*function)(), const uint8_t hr, const uint8_t min, const uint8_t sec, const uint8_t day, const uint8_t mnth, uint16_t yr) {
  time_t t = ezt::makeTime(hr, min, sec, day, mnth, yr);
  return setEvent(function, t);
}

uint8_t Timezone::setEvent(void (*function)(), time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  for (uint8_t n = 0; n < MAX_EVENTS; n++) {
    if (!_events[n].function) {
      _events[n].function = function;
      _events[n].time = t;
  //////    debug("Set event (#%d ) to trigger on: %s\r" , n + 1 , (UTC.dateTime(t)).c_str());;
      return n + 1;
    }
  }
  
  triggerError(TOO_MANY_EVENTS);
  return 0;
}

void Timezone::setTime(const time_t t, const uint16_t ms /* = 0 */) {
  int16_t offset;
  offset = getOffset(t);
  _last_sync_time = t + offset * 60;
  _last_sync_millis = millis() - ms;
  _time_status = timeSet;
}

void Timezone::setTime(const uint8_t hr, const uint8_t min, const uint8_t sec, const uint8_t day, const uint8_t mnth, uint16_t yr) {
  tmElements_t tm;
  // year can be given as full four digit year or two digts (2010 or 10 for 2010);  
  // it is converted to years since 1970
  if( yr > 99) {
    yr = yr - 1970;
  } else {
    yr += 30; 
  }
  tm.Year = yr;
  tm.Month = mnth;
  tm.Day = day;
  tm.Hour = hr;
  tm.Minute = min;
  tm.Second = sec;
  setTime(ezt::makeTime(tm));
}

String Timezone::dateTime(const String format /* = DEFAULT_TIMEFORMAT */) {
  return dateTime(TIME_NOW, format);
}

String Timezone::dateTime(const time_t t, const String format /* = DEFAULT_TIMEFORMAT */) {
  return dateTime(t, LOCAL_TIME, format);
}

String Timezone::dateTime(time_t t, const ezLocalOrUTC_t local_or_utc, const String format /* = DEFAULT_TIMEFORMAT */) {

  String tzname;
  bool is_dst;
  int16_t offset;

  if (t == TIME_NOW || t == LAST_READ || local_or_utc == UTC_TIME) {
    // in these cases we actually want tzTime to transform the time for us
    // back in to this timezone's time as well as grab the timezone info
    // from the stored POSIX data
    t = tzTime(t, UTC_TIME, tzname, is_dst, offset);
  } else {
    // when receiving a local time we don't want to transform the timestamp
    // but rather use tzTime to just parse the info about the timezone from
    // the stored POSIX data
    tzTime(t, LOCAL_TIME, tzname, is_dst, offset);
  }

  String tmpstr;
  uint8_t tmpint8;
  String out = "";

  tmElements_t tm;
  ezt::breakTime(t, tm);

  int8_t hour12 = tm.Hour % 12;
  if (hour12 == 0) hour12 = 12;
  
  int32_t o;

  bool escape_char = false;
  
  for (uint8_t n = 0; n < format.length(); n++) {
  
    char c = format.charAt(n);
    
    if (escape_char) {
      out += String(c);
      escape_char = false;
    } else {
    
      switch (c) {
    
        case '\\':  // Escape character, ignore this one, and let next through as literal character
        case '~': // Same but easier without all the double escaping
          escape_char = true;
          break;
        case 'd': // Day of the month, 2 digits with leading zeros
          out += ezt::zeropad(tm.Day, 2);
          break;
        case 'D': // A textual representation of a day, usually two or three letters
          out += ezt::dayShortStr(tm.Wday);
          break;
        case 'j': // Day of the month without leading zeros
          out += String(tm.Day);
          break;
        case 'l': // (lowercase L) A full textual representation of the day of the week
          out += ezt::dayStr(tm.Wday);
          break;
        case 'N': // ISO-8601 numeric representation of the day of the week. ( 1 = Monday, 7 = Sunday )
          tmpint8 = tm.Wday - 1;
          if (tmpint8 == 0) tmpint8 = 7;
          out += String(tmpint8);
          break;
        case 'S': // English ordinal suffix for the day of the month, 2 characters (st, nd, rd, th)
          switch (tm.Day) {
            case 1:
            case 21:
            case 31:
              out += F("st"); break;
            case 2:
            case 22:
              out += F("nd"); break;
            case 3:
            case 23:
              out += F("rd"); break;
            default:
              out += F("th"); break;
          }
          break;
        case 'w': // Numeric representation of the day of the week ( 0 = Sunday )
          out += String(tm.Wday);
          break;
        case 'F': // A full textual representation of a month, such as January or March
          out += ezt::monthStr(tm.Month);
          break;
        case 'm': // Numeric representation of a month, with leading zeros
          out += ezt::zeropad(tm.Month, 2);
          break;
        case 'M': // A short textual representation of a month, usually three letters
          out += ezt::monthShortStr(tm.Month);
          break;
        case 'n': // Numeric representation of a month, without leading zeros
          out += String(tm.Month);
          break;
        case 't': // Number of days in the given month
          out += String(monthDays[tm.Month - 1]);
          break;
        case 'Y': // A full numeric representation of a year, 4 digits
          out += String(tm.Year + 1970);
          break;
        case 'y': // A two digit representation of a year
          out += ezt::zeropad((tm.Year + 1970) % 100, 2);
          break;
        case 'a': // am or pm
          out += (tm.Hour < 12) ? F("am") : F("pm");
          break;
        case 'A': // AM or PM
          out += (tm.Hour < 12) ? F("AM") : F("PM");
          break;
        case 'g': // 12-hour format of an hour without leading zeros
          out += String(hour12);
          break;
        case 'G': // 24-hour format of an hour without leading zeros
          out += String(tm.Hour);
          break;
        case 'h': // 12-hour format of an hour with leading zeros
          out += ezt::zeropad(hour12, 2);
          break;
        case 'H': // 24-hour format of an hour with leading zeros
          out += ezt::zeropad(tm.Hour, 2);
          break;
        case 'i': // Minutes with leading zeros
          out += ezt::zeropad(tm.Minute, 2);
          break;
        case 's': // Seconds with leading zeros
          out += ezt::zeropad(tm.Second, 2);
          break;
        case 'T': // abbreviation for timezone
          out += tzname;  
          break;
        case 'v': // milliseconds as three digits
          out += ezt::zeropad(_last_read_ms, 3);        
          break;
        #ifdef EZTIME_NETWORK_ENABLE
          case 'e': // Timezone identifier (Olson)
            out += getOlson();
            break;
        #endif
        case 'O': // Difference to Greenwich time (GMT) in hours and minutes written together (+0200)
        case 'P': // Difference to Greenwich time (GMT) in hours and minutes written with colon (+02:00)
          o = offset;
          out += (o < 0) ? "+" : "-";   // reversed from our offset
          if (o < 0) o = 0 - o;
          out += ezt::zeropad(o / 60, 2);
          out += (c == 'P') ? ":" : "";
          out += ezt::zeropad(o % 60, 2);
          break;  
        case 'Z': //Timezone offset in seconds. West of UTC is negative, east of UTC is positive.
          out += String(0 - offset * 60);
          break;
        case 'z':
          out += String(dayOfYear(t)); // The day of the year (starting from 0)
          break;
        case 'W':
          out += ezt::zeropad(weekISO(t), 2); // ISO-8601 week number of year, weeks starting on Monday
          break;
        case 'X':
          out += String(yearISO(t)); // ISO-8601 year-week notation year, see https://en.wikipedia.org/wiki/ISO_week_date
          break;
        case 'B':
          out += militaryTZ(t);
          break;
        default:
          out += String(c);

