IZ7BOJ/ESP32_LoRa_APRS_SARIMESH/src/ezTime_loc.cpp
      }
    }
  }
  
  return out;
}

String Timezone::militaryTZ(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  int16_t o = getOffset(t);
  if (o % 60) return "?"; // If it's not a whole hour from UTC, it's not a timezone with a military letter code
  o = o / 60;
  if (o > 0) return String((char)('M' + o));
  if (o < 0 && o >= -9) return String((char)('A' - o - 1)); // Minus a negative number == plus 1
  if (o < -9) return String((char)('A' - o));       // Crazy, they're skipping 'J'
  return "Z";
}


uint8_t Timezone::hour(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  return t / 3600 % 24;
}

uint8_t Timezone::minute(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  return t / 60 % 60;
}

uint8_t Timezone::second(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  return t % 60;
}

uint16_t Timezone::ms(time_t t /*= TIME_NOW */) {
  // Note that here passing anything but TIME_NOW or LAST_READ is pointless
  if (t == TIME_NOW) { nowUTC(); return _last_read_ms; }
  if (t == LAST_READ) return _last_read_ms;
  return 0;
}

uint8_t Timezone::day(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  tmElements_t tm;
  ezt::breakTime(t, tm);
  return tm.Day;
}

uint8_t Timezone::weekday(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  tmElements_t tm;
  ezt::breakTime(t, tm);
  return tm.Wday;
}

uint8_t Timezone::month(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  tmElements_t tm;
  ezt::breakTime(t, tm);
  return tm.Month;
}

uint16_t Timezone::year(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  tmElements_t tm;
  ezt::breakTime(t, tm);
  return tm.Year + 1970;
}

uint16_t Timezone::dayOfYear(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  time_t jan_1st = ezt::makeTime(0, 0, 0, 1, 1, year(t));
  return (t - jan_1st) / SECS_PER_DAY;
}

uint8_t Timezone::hourFormat12(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  uint8_t h = t / 3600 % 12;
  if (h) return h;
  return 12;
}

bool Timezone::isAM(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  return (t / 3600 % 24 < 12);
}

bool Timezone::isPM(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  return (t / 3600 % 24 >= 12);
}


// Now this is where this gets a little obscure. The ISO year can be different from the
// actual (Gregorian) year. That is: you can be in january and still be in week 53 of past
// year, _and_ you can be in december and be in week one of the next. The ISO 8601 
// definition for week 01 is the week with the Gregorian year's first Thursday in it.  
// See https://en.wikipedia.org/wiki/ISO_week_date
//
#define startISOyear(year...) ezt::makeOrdinalTime(0, 0, 0, FIRST, THURSDAY, JANUARY, year) - 3UL * SECS_PER_DAY;
uint8_t Timezone::weekISO(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  int16_t yr = year(t);
  time_t this_year = startISOyear(yr);
  time_t prev_year = startISOyear(yr - 1);
  time_t next_year = startISOyear(yr + 1);
  if (t < this_year) this_year = prev_year;
  if (t >= next_year) this_year = next_year;
  return (t - this_year) / ( SECS_PER_DAY * 7UL) + 1;
}

uint16_t Timezone::yearISO(time_t t /*= TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) {
  t = tzTime(t, local_or_utc);
  int16_t yr = year(t);
  time_t this_year = startISOyear(yr);
  time_t next_year = startISOyear(yr + 1);
  if (t < this_year) return yr - 1;
  if (t >= next_year) return yr + 1;
  return yr;
}

extern Timezone UTC;

namespace ezt {
  // All bounce-throughs to defaultTZ
  String dateTime(const String format /* = DEFAULT_TIMEFORMAT */) { return (defaultTZ->dateTime(format)); }
  String dateTime(time_t t, const String format /* = DEFAULT_TIMEFORMAT */) { return (defaultTZ->dateTime(t, format)); }
  String dateTime(time_t t, const ezLocalOrUTC_t local_or_utc, const String format /* = DEFAULT_TIMEFORMAT */) { return (defaultTZ->dateTime(t, local_or_utc, format)); }
  uint8_t day(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->day(t, local_or_utc)); } 
  uint16_t dayOfYear(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->dayOfYear(t, local_or_utc)); }
  int16_t getOffset(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->getOffset(t, local_or_utc)); }
  String getTimezoneName(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->getTimezoneName(t, local_or_utc)); }
  uint8_t hour(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->hour(t, local_or_utc)); }
  uint8_t hourFormat12(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->hourFormat12(t, local_or_utc)); }
  bool isAM(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->isAM(t, local_or_utc)); }
  bool isDST(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->isDST(t, local_or_utc)); }
  bool isPM(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->isPM(t, local_or_utc)); }
  String militaryTZ(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->militaryTZ(t, local_or_utc)); }
  uint8_t minute(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->minute(t, local_or_utc)); }
  uint8_t month(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->month(t, local_or_utc)); } 
  uint16_t ms(time_t t /* = TIME_NOW */) { return (defaultTZ->ms(t)); }
  time_t now() { return  (defaultTZ->now()); }
  uint8_t second(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->second(t, local_or_utc)); } 
  uint8_t setEvent(void (*function)(), const uint8_t hr, const uint8_t min, const uint8_t sec, const uint8_t day, const uint8_t mnth, uint16_t yr) { return (defaultTZ->setEvent(function,hr, min, sec, day, mnth, yr)); }
  uint8_t setEvent(void (*function)(), time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->setEvent(function, t, local_or_utc)); }
  void setTime(const uint8_t hr, const uint8_t min, const uint8_t sec, const uint8_t day, const uint8_t month, const uint16_t yr) { defaultTZ->setTime(hr, min, sec, day, month, yr); }
  void setTime(time_t t) { defaultTZ->setTime(t); }
  uint8_t weekISO(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->weekISO(t, local_or_utc)); }
  uint8_t weekday(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->weekday(t, local_or_utc)); }
  uint16_t year(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->year(t, local_or_utc)); } 
  uint16_t yearISO(time_t t /* = TIME_NOW */, const ezLocalOrUTC_t local_or_utc /* = LOCAL_TIME */) { return (defaultTZ->yearISO(t, local_or_utc)); }
}


void ezTime_setup() {
   Serial.println("init ezTime synchronization with GPS/NTP: this check takes 5 or more seconds");
   Serial.printf("ezTime_setup-GPS: no_gps = %d - has_GPS = %d - standalone = %d - has_DS3231 = %d\r",no_gps, has_GPS,  standalone, has_DS3231);
   GPS_time_status = timeNotSet; NTP_time_status = timeNotSet;
   

   int cntr=10;  // try to check if GPS is available
   while ( ( GPS_time_status != 2 ) && (cntr-- >0) && (! no_gps) && has_GPS ){  // 2--> timeSet 
     if(ezTime_debug) debugA("ezTime_setup-GPS: ======(%d)======> try to check if a valid GPS fix is available...\r",cntr);
         gps_loop();  // go trough GPS NMEA sentences acquisition 
     vTaskDelay(pdMS_TO_TICKS(1000));
 //        updateGPS();
     if(ezTime_debug) debugA("   ezTime_setup-GPS: after events() GPS_time_status = %d \r",GPS_time_status);
     };
   if((cntr > 0) && (GPS_time_status == 2)) debugA("ezTime_setup-GPS: cntr = %d - GPS fix available: GPS_time_status = %d - gps.satellites.value = %d\r", cntr, GPS_time_status, gps.satellites.value() );

   cntr=10;  // try to check if NTP is available
   while (( NTP_time_status != 2)&& (cntr-- >0) && (! standalone ) ){  // 2--> timeSet 
     if(ezTime_debug)debugA("   ezTime_setup-GPS: ======(%d)======> try to check if a NTP fix is available...\r",cntr);
     vTaskDelay(pdMS_TO_TICKS(1000));  
////    updateNTP();  
     update_NTP_GPS();
     if(ezTime_debug) debugA("   ezTime_setup-GPS: after events() NTP_time_status = %d \r",NTP_time_status);
     };

   if((cntr > 0) && (NTP_time_status == 2))Serial.printf("   ezTime_setup-GPS: NTP fix available: cntr = %d - NTP_time_status = %d \r", cntr, NTP_time_status );

   setInterval(0); // start ezTime events to service NTP_GPS sync  
   events();  // initialize or perform ezTime events   
}

#endif
